# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'wget'
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
# brew 'php'
# brew 'php@7.4'
# brew 'php@7.3'
# brew 'composer'
# brew 'imagemagick'
# brew 'libmemcached'
# brew 'meilisearch'
# brew 'memcached'
# brew 'mysql'
# brew 'nginx'
brew 'node'
# brew 'redis'
brew 'yarn'
brew 'starship'

# Apps
# cask '1password'
# cask '1password-cli'
cask 'aerial'
cask 'alfred'
cask 'brave-browser'
cask 'caffeine'
cask 'coscreen'
cask 'cyberduck'
cask 'dbngin'
# cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'flycut'
cask 'github'
# cask 'google-backup-and-sync'
cask 'google-chrome'
# cask 'gpg-suite'
cask 'imageoptim'
cask 'insomnia'
cask 'kap'
# cask 'phpmon'
# cask 'pushplaylabs-sidekick'
# cask 'ray'
cask 'rectangle'
# cask 'signal'
cask 'slack'
cask 'the-unarchiver'
cask 'transmission'
# cask 'tunnelbear'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code-nerd-font'

# Mac App Store
## mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
## mas 'Keynote', id: 409183694
# mas 'FruitJuice', id: 671736912
## mas 'Numbers', id: 409203825
## mas 'Spark', id: 1176895641
# mas 'Speedtest', id: 1153157709
# mas 'TweetDeck', id: 485812721
# mas 'WiFi Explorer', id: 494803304
